cross-sky/ucos/EvalBoards/ST/STM3240G-EVAL/BSP/bsp.h
void         BSP_IRQHandlerUART7              (void);
void         BSP_IRQHandlerUART8              (void);
void         BSP_IRQHandlerSPI4               (void);
void         BSP_IRQHandlerSPI5               (void);
void         BSP_IRQHandlerSPI6               (void);
void         BSP_IRQHandlerSAI1               (void);
void         BSP_IRQHandlerLTDC               (void);
void         BSP_IRQHandlerLTDC_ER            (void);
void         BSP_IRQHandlerDMA2D              (void);

/*
*********************************************************************************************************
*                                     PERIPHERAL POWER/CLOCK SERVICES
*********************************************************************************************************
*/

CPU_INT32U   BSP_PeriphClkFreqGet        (CPU_DATA       pwr_clk_id);

void         BSP_PeriphEn                (CPU_DATA       pwr_clk_id);

void         BSP_PeriphDis               (CPU_DATA       pwr_clk_id);

/*
*********************************************************************************************************
*                                              LED SERVICES
*********************************************************************************************************
*/

void        BSP_LED_On                        (Led_TypeDef Led);

void        BSP_LED_Off                       (Led_TypeDef Led);

void        BSP_LED_Toggle                    (Led_TypeDef Led);

/*
*********************************************************************************************************
*                                             MODULE END
*********************************************************************************************************
*/
void SystemIn(void);

#endif                                                          /* End of module include.                               */

